local BilliardsNetDefine = {
    
    Net2S_5101 = 5101, ---母球移动
    Net2S_5102 = 5102,  ---调整角度
    Net2S_5103 = 5103,  --击球
    Net2S_5104 = 5104, --击球结果上报
    Net2S_5105 = 5105, ---断线重连

    Net2C_5005 = 5005,  --断线重连
    Net2C_5001 = 5001,   ---游戏开始
    Net2C_5002 = 5002,  ---通知击球
    Net2C_5003 = 5003, ---分球消息
    Net2C_5101 = 5101, ---母球移动
    Net2C_5102 = 5102,  ---调整角度
    Net2C_5004 = 5004,   ---犯规消息
    Net2C_5006 = 5006, ---游戏结束
    Net2C_5103 = 5103,  --击球
    Net2C_5007 = 5007,

    ---测试摆球
    Net2S_5106 = 5106,
    Net2C_5106 = 5106 --测试摆球
}

return BilliardsNetDefine